---
kind: method
id: M:Autodesk.Revit.DB.LeaderArray.Append(Autodesk.Revit.DB.Leader)
source: html/ea1066b1-372e-5f05-489e-a2734e939a24.htm
---
# Autodesk.Revit.DB.LeaderArray.Append Method

Add the item to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	Leader item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Leader`) - The item to be added.